"use strict";
let namme ;
let admin;
namme = 'Oleksandr';
admin = namme ;
console.log(admin);
let days;
days = 7;
let result;
result = days* 24*60*60;
console.log( days + ' днів = ' + result + ' секунд');
 
let pe = prompt("Введить повідомлення для консолі  ")  ;
console.log(pe);

    
//1)Як можна оголосити змінну у Javascript ---- змінну можна оголосити за допомогою команд let  const   та var . const лише для констант і їЇ змінювати не можна  ,
//let для будь чого , var це застарілий спосіб який зараз не рекомендуеться використовувати .
//2)У чому різниця між функцією prompt та функцією confirm? ------prompt викликає діалогове вікно з полем для введення, confirm - вікно з підтвердженням.
//3)Що таке неявне перетворення типів? Наведіть один приклад.------Це коли один тип данних перетворюють на інший наприклад  на рядок,число булевий тип . 
//let str = "123";
//let num = Number(str);
//ми перетворили рядок 123 на число 123.


